diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/CommonModules/ВКМ_Формы/Module.bsl
#Область ПрограммныйИнтерфейс 

Процедура ВКМ_ДобавитьЭлементыФормы(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда 
			
		ВКМ_ДобавитьВДоговорыКонтрагентов(Форма);  
		
	ИначеЕсли  ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		ВКМ_ДобавитьВРеализацияТоваровУслуг(Форма);
				
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ДобавитьВДоговорыКонтрагентов(Форма) 
	
	ГруппаДопРеквизиты = Форма.Элементы.Добавить("ГруппаДопРеквизиты", Тип("ГруппаФормы"));
	ГруппаДопРеквизиты.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	ГруппаДопРеквизиты.ОтображатьЗаголовок = Ложь;
	ГруппаДопРеквизиты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"), Форма.Элементы.ГруппаДопРеквизиты);
	ПолеВвода.Заголовок = "Дата начала действия договора";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), Форма.Элементы.ГруппаДопРеквизиты);
	ПолеВвода.Заголовок = "Дата окончания действия договора";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"), Форма.Элементы.ГруппаДопРеквизиты);
	ПолеВвода.Заголовок = "Сумма абоненсткой платы";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_СтоимостьЧасаРаботыСпециалиста", Тип("ПолеФормы"), Форма.Элементы.ГруппаДопРеквизиты);
	ПолеВвода.Заголовок = "Стоимость часа работы специалиста";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";
	
КонецПроцедуры   

Процедура ВКМ_ДобавитьВРеализацияТоваровУслуг(Форма)

//	Команда = Форма.Команды.Добавить("ВКМ_КомандаЗаполнить");
//	Команда.Действие = "ВКМ_ДействиеЗаполнить";
//	
//	Кнопка = Форма.Элементы.Добавить("ВКМ_КнопкаЗаполнить", Тип("КнопкаФормы"), Форма.Элементы.УслугиКоманднаяПанель);
//	Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
//	Кнопка.ИмяКоманды = "ВКМ_КомандаЗаполнить";
//	Кнопка.Заголовок = "Заполнить";
	
	НоваяКоманда = Форма.Команды.Добавить("Заполнить");
	НоваяКоманда.Заголовок = "Заполнить";
	НоваяКоманда.Действие = "ВКМ_Заполнить";	
	Кнопка = Форма.Элементы.Добавить("ВКМ_Заполнить", Тип("КнопкаФормы"), Форма.Элементы.УслугиКоманднаяПанель);
	Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Кнопка.ИмяКоманды = "Заполнить";	
КонецПроцедуры

#КонецОбласти
